console.log('Introduction To JavaScript');
//Practice 
//توقع قيمة التعبيرات التالية ثم جربها في وحدة التحكم 
9 + 1 * 5;  // => 14
9 % 2;  // => 1
(9 / 3) * (10 - 7);  // => 9
21 / 3 + (3 * 9) * 9 + 5;  // => 255
36 / 9 + 48 - 10 / 2;  // => 47


// اكتب تعبيرًا يمثل متوسط ​​علامة الامتحان ، مع العلم أنه في فصل من عشرة طلاب ، خمسة منهم حصلوا على 24/30 ، اثنان منهم حصلوا على 16/30 والباقي حصلوا على 29/30
( 5 * 24 + 2 * 16 + 3 * 29 ) / 10 
// => 23.9

//اكتب تعبيرًا يمثل عدد الثواني في 30 يومًا

60 * 60 * 24 * 30 
//اليوم 30
//60 دقيقة
//24 ساعة
// 60 ثواني
// => 2592000

//باستخدام تسلسل السلسلة ، اكتب تعبيرًا يمثل اسمك الأول واسم العائلة والجنس والجنسية

'Osama' + ' ' +  'Salem' + ' ' + 'Male' + ' ' + 'Jordan'  
// => "osama salem, Male, Jordanian"

//قبل تجربة التعبيرات التالية ، حاول التنبؤ بالنتيجة

10 + "10"; // => "1010"
"10" + "10"; // => "1010"
10 + 10 + "5"; // => "205"
"Hello" + 1; // => "Hello1"
false - true; // => -1
true  - false; // => 1


 